# Вывести четные значение от 0 до 20 включительно, только через реализацию цикла (без условий!).


for i in range(0, 21, 2):
    print(i)