# Вывести четные значение от 0 до 20 включительно, через реализацию условий.

for i in range(0, 21):
    if i % 2 == 0:
        print(i)
